emacs/README.org
#+title: Emacs configurations to my taste
#+author: Lucas Lima (limaflucas)
#+STARTUP: show2levels
#+OPTIONS: toc:3

* Table of contents :toc:
- [[#packages][Packages]]
  - [[#lang][Lang]]
  - [[#exporting][Exporting]]
- [[#configurations][Configurations]]
  - [[#org][Org]]
  - [[#gui--behaviour][GUI & behaviour]]
  - [[#exporting-1][Exporting]]
- [[#installation][Installation]]

* Packages
** Lang
*** Org
**** Toc
#+begin_src emacs-lisp :tangle my-packages.el
(package! toc-org)
#+end_src
**** Bullets
#+begin_src emacs-lisp :tangle my-packages.el
(package! org-bullets)
#+end_src
**** Tempo
#+begin_src emacs-lisp :tangle my-packages.el
;;(package! 'org-tempo)
#+end_src

** Exporting
#+begin_src emacs-lisp :tangle my-packages.el
(provide 'my-packages)
#+end_src

* Configurations
** Org
*** Toc
#+begin_src emacs-lisp :tangle my-configs.el
(use-package! toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src
*** Bullets
#+begin_src emacs-lisp :tangle my-configs.el
(use-package! org-bullets)
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src
*** Tempo
#+begin_src emacs-lisp :tangle my-configs.el
(use-package! org-tempo)
#+end_src
*** Languages
#+begin_src emacs-lisp :tangle my-configs.el
(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)))
#+end_src

** GUI & behaviour
*** Typing
#+begin_src emacs-lisp :tangle my-configs.el
(delete-selection-mode 1)
#+end_src
*** Indent
#+begin_src emacs-lisp :tangle my-configs.el
(electric-indent-mode -1)
(electric-pair-mode 1)
;; The following prevents <> from auto-pairing when electric-pair-mode is on.
;; Otherwise, org-tempo is broken when you try to <s TAB...
(add-hook 'org-mode-hook (lambda ()
                           (setq-local electric-pair-inhibit-predicate
                                       `(lambda (c)
                                          (if (char-equal c ?<) t   (,electric-pair-inhibit-predicate   c))))))
#+end_src
*** File
#+begin_src emacs-lisp :tangle my-configs.el
(global-auto-revert-mode t)
#+end_src

** Exporting
#+begin_src emacs-lisp :tangle my-configs.el
(provide 'my-configs)
#+end_src


* Installation
In order to install the packages and its configurations, run the script install.sh. The script will perform every needed action but won't restart the emacs or any daemons associated.
#+begin_src shell :results output :shebang #!/bin/zsh :tangle install.sh
# checks whether the packages and configurations files are present
MY_PKGS="my-packages.el"
MY_CFGS="my-configs.el"
DOOM_DIR="$HOME/.config/doom"

if [ ! -f "$MY_PKGS" ] || [ ! -f "$MY_CFGS" ]; then
    echo "Before running, you must create your package and configuration files"
    return -1;
fi

if [ ! -d "$DOOM_DIR" ]; then
   echo "Apparently you don't have doom installed. First, complete your Doom installation and the run this script again"
   return -1;
fi

echo "Appending commands to Doom's config.el"
echo "\n(load \"~/.config/doom/my-configs\")" >> $DOOM_DIR/config.el
echo "(require 'my-configs)" >> $DOOM_DIR/config.el


echo "Appending commands to Doom's packages.el"
echo "\n(load \"~/.config/doom/my-packages\")" >> $DOOM_DIR/packages.el
echo "(require 'my-packages)" >> $DOOM_DIR/packages.el

echo "Copying custom files to $DOOM_DIR"
cp my-packages.el my-configs.el $DOOM_DIR/.
echo "All set! Your free to go."
return 0;
#+end_src
